class מחלקת_רכישה:
    def __init__(self, מחיר_דירה, מס_רכישה, שכר_טרחה_עורכדין, דמי_תיווך, דמי_ייעוץ_משכנתא, דמי_פיקוח, אגרות, שכר_טרחה_שמאי, הוצאות_נסיעה, עלות_שיפוץ, הון_עצמי_שהושקע):
        self.מחיר_דירה = מחיר_דירה
        self.מס_רכישה = מס_רכישה
        self.שכר_טרחה_עורכדין = שכר_טרחה_עורכדין
        self.דמי_תיווך = דמי_תיווך
        self.דמי_ייעוץ_משכנתא = דמי_ייעוץ_משכנתא
        self.דמי_פיקוח = דמי_פיקוח
        self.אגרות = אגרות
        self.שכר_טרחה_שמאי = שכר_טרחה_שמאי
        self.הוצאות_נסיעה = הוצאות_נסיעה
        self.עלות_שיפוץ = עלות_שיפוץ
        self.הון_עצמי_שהושקע = הון_עצמי_שהושקע

    def סך_הכל_עלויות_רכישה(self):
        return (
            self.מחיר_דירה + self.מס_רכישה + self.שכר_טרחה_עורכדין +
            self.דמי_תיווך + self.דמי_ייעוץ_משכנתא + self.דמי_פיקוח +
            self.אגרות + self.שכר_טרחה_שמאי + self.הוצאות_נסיעה + self.עלות_שיפוץ
        )
